xiaxquan/Tradition_DTU/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* UPDATE ----------------------------------------------------------------------*/
#define SDRAM_ADDR_UPDATE             0xC0000000         // 1M

/* LOGO ----------------------------------------------------------------------*/
#define COMMON_DATA_M_SP_NA_1              1            // 单点信息
#define COMMON_DATA_M_DP_NA_1              3            // 双点信息
#define COMMON_DATA_M_ME_NA_1              9            // 测量值，归一化值
#define COMMON_DATA_M_ME_NB_1              11           // 测量值，标度化值
#define COMMON_DATA_M_ME_NC_1              13           // 测量值，短浮点数
#define COMMON_DATA_M_SP_TB_1              30           // 带时标的单点信息
#define COMMON_DATA_M_DP_TB_1              31           // 带时标的双点信息
#define COMMON_DATA_M_FT_NA_1              42           // 故障事件信息
#define COMMON_DATA_M_IT_NB_1              206          // 累计量，短浮点数
#define COMMON_DATA_M_IT_TC_1              207          // 带时标累计量，短浮点数

/* ADDR ----------------------------------------------------------------------*/
#define TELESIGNAL_START_ADDR         0x0001      // 遥信起始地址
#define TELEMETRY_START_ADDR          0x4001      // 遥测起始地址
#if RT_USING_TELEMETRY_SET
#define TELEMETRY_SETENABLE_START_ADDR    0x4801      // 遥测置数使能起始地址
#define TELEMETRY_SETVALUE_START_ADDR     0x4881      // 遥测置数值起始地址
#endif
#define REMOTE_START_ADDR             0x6001      // 遥控起始地址
#define INTRIPARAME_START_ADDR        0x8001      // 终端固有参数起始地址
#define RUNPARAMETER_START_ADDR       0x8101      // 终端运行参数起始地址
#define CALIBRATE_FACTOR_START_ADDR   0x8201    	// 校准系数起始地址
#define CALIBRATE_VALUE_START_ADDR    0x8240    	// 校准值起始地址
#define FIXED_VALUE_START_ADDR         0x8301	    // 终端保护定值起始地址

#define OPEN_SELECT_FAIL              (0x01 | 0x20) // 遥控分闸选择失败  00000001
#define OPEN_SELECT_SUCCESS           (0x05 | 0x20) // 遥控分闸选择成功  00000101
#define OPEN_EXECUTE_FAIL             (0x09 | 0x20) // 遥控分闸执行失败  00001001						   
#define OPEN_EXECUTE_SUCCESS          (0x0D | 0x20) // 遥控分闸执行成功  00001101						   							  							   
#define CLOSE_SELECT_FAIL             (0x02 | 0x20) // 遥控合闸选择失败  00000010
#define CLOSE_SELECT_SUCCESS          (0x06 | 0x20) // 遥控合闸选择成功  00000110
#define CLOSE_EXECUTE_FAIL            (0x0A | 0x20) // 遥控合闸执行失败  00001010
#define CLOSE_EXECUTE_SUCCESS         (0x0E | 0x20) // 遥控合闸执行成功  00001110
#define CLOSE_LOOP_SELECT_FAIL        (0x03 | 0x20) // 合环选择失败      00000011
#define CLOSE_LOOP_SELECT_SUCCESS     (0x07 | 0x20) // 合环选择成功      00000111
#define CLOSE_LOOP_EXECUTE_FAIL       (0x0B | 0x20) // 合环执行失败      00001011
#define CLOSE_LOOP_EXECUTE_SUCCESS    (0x0F | 0x20) // 合环执行成功      00001111
#define DISTANT_REMOTE_CANCEL         (0x10 | 0x20) // 遥控取消          00010000

/* VALUE ----------------------------------------------------------------------*/
#define PULSE_TIME                    100.0f      // 分合闸脉宽时间
#define ENERGY_STORAGE_TIME           10000       // 储能时间
#define DEVICE_FAULT_TIME             10000       // 装置故障时间
#define LOOP_DISCONNECT_TIME          5000        // 控制回路断线时间

#define DEADZONE_UP                   (100.0f)
#define DEADZONE_DOWN                 (1.0f)
#define DEADZONE_DEFAULT              (20.0f)

/* OPER ----------------------------------------------------------------------*/
/* 开出操作类型枚举 */
enum DoOperateType
{
    DO_CLOSE = 1,                      // 手动合闸
    DO_CLOSE_RECOVERY,                 // 合闸收回
    DO_OPEN,                           // 手动分闸
    DO_OPEN_RECOVERY,                  // 分闸收回
    DO_COIL_ENERGY_STORAGE,            // 线圈储能
    DO_ALARM_LED,                      // 告警灯
    DO_LOGIC_OPEN,                     // 逻辑分
    DO_LOGIC_CLOSE,                    // 逻辑合
};

enum Frequency
{
    FRE_Uab,
	FRE_UBC,
	FRE_NUM
};
/* FRAM----------------------------------------------------------------------*/
#define ADDR_FRAM_MONITOR               0x00000  // FRAM自检
#define ADDR_FRAM_UPDATE                0x00001  // 在线更新 2字节
#define ADDR_FRAM_START_NUM             0x00003  // 开机次数一个字节
#define ADDR_FRAM_CURRENT_SN            0x00004  // 当前定值区号 1个字节
#define ADDR_FRAM_PASSPHRASE            0x00005  // 密码存储 16个字节   

#define ADDR_FRAM_CALI_FACTOR           0x00050  // 校准系数存储起始地址 0x50
#define ADDR_FRAM_AREA0                 0x00100	 // FRAM参数存储起始地址 运行参数0区     0x600
#define ADDR_FRAM_AREA1		            0x00700	 // FRAM参数存储起始地址	定值区一     0x600
#define ADDR_FRAM_AREA2		            0x00D00	 // FRAM参数存储起始地址	定值区二     0x600

#define ADDR_FRAM_SOE                   0x01300  // FRAM参数存储起始地址 SOE  // 0x1400
#define ADDR_FRAM_SOE_NEW               0x02700  // FRAM参数存储起始地址 SOE  // 0x1400
#define ADDR_FRAM_FEVENT                0x03B00  // 故障事件起始地址 0x500
#define ADDR_FRAM_CO                    0x04000  // 操作记录起始地址 0x300
#define ADDR_FRAM_LOG                   0x04300  // 日志起始地址 0x1000
#define ADDR_FRAM_MEMORY                0x05300  // 状态标志地址 0x100
#define ADDR_FRAM_TELISIGNAL            0x05400  // 遥信起始地址 0x200
//#define ADDR_FRAM_JSON_MD5              0x05600  // MDK5数值   0x20

#define ADDR_FRAM_HARDMAP               0x07000  // 配置起始地址   0x0100
#define ADDR_FRAM_CONFIG                0x08000  // 配置起始地址   0x1000

/* flag */                                        



/* FRAM区域枚举 */
enum FramArea
{
    VALUE_AREA0,                       // 定值区0
    VALUE_AREA1,                       // 定值区1
    VALUE_AREA2,                       // 定值区2
    SOE_RECODE,                        // SOE数据
    SOE_NEW_RECODE,                    // 新SOE数据
    FEVENT_RECODE,                     // FAULT_EVENT数据
    CO_RECODE,                         // 操作记录  
    LOG_RECODE,                        // 日志记录   
		MEMORY_FLAG,                       // 记录标志缓存
    CFG_RECODE,                        // 配置   
    HARDMAP_RECODE,                        // 硬件映射    
    TELESIGNAL,                        // 遥信数据
		PASSPHRASE,                        // 密码管理
    CURRENT_SN,                        // 当前定值区号
    JSON_MD5,                          // JSON校验码
    FRAM_AREA_NUM                      // 分区数量
};

enum UpdateState
{
  UPDATE_START,    // 升级启动
	UPDATE_COMPLATE, // 更新完成
	UPDATE_BACK,     // 回退
	RUN_NOMAL        // 运行正常
};

struct RecordStateType
{
	uint8_t flag;
	int32_t position;
	int32_t num;
};

