xiaxquan/Tradition_DTU/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
struct ValueParaPreset
{
    ValueParameterStr property[VALUE_PARAMETER_TOTAL_NUM];
    float value[VALUE_PARAMETER_TOTAL_NUM * 4 + 24];
};

/* RECORD ----------------------------------------------------------------------*/
/* COS数据结构体 */
__packed struct COS_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
};

/* SOE数据结构体 */
__packed struct SOE_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

/* CO数据结构体 */
__packed struct CO_Str
{
    rt_uint16_t addr;
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

/* 变化遥测数据结构体 */
__packed struct NVA_Str
{
    rt_uint16_t addr;
    float value;
};

/* 故障事件数据结构体 */
__packed struct FEVENT_Str
{
    rt_uint8_t yx_num;
    rt_uint8_t yx_type;
    struct SOE_Str yx[1];
    rt_uint8_t yc_num;
    rt_uint8_t yc_type;
    struct NVA_Str yc[10];
};

/* ULOG数据结构体 */
__packed struct ULOG_Str
{
    rt_uint16_t addr;
    char description[24];
    rt_uint8_t  value;
    struct CP56Time2a_t time;
};

struct Queue_Flag_Str
{
    rt_uint16_t full;
    rt_uint16_t in;
    rt_uint16_t out[DEV_MAX_NUM];
};

struct Fatfs_Flag_Str
{
    rt_uint16_t fullnum;
    rt_uint16_t currentnum;
};

/* memory数据结构体 */
struct MEMORY_FLAG_Str
{
    struct Queue_Flag_Str queue_soe;
    struct Queue_Flag_Str queue_soe_new;
    struct Queue_Flag_Str queue_co;
    struct Queue_Flag_Str queue_fevent;
    struct Queue_Flag_Str queue_ulog;
    struct Fatfs_Flag_Str fatfs_soe;
    struct Fatfs_Flag_Str fatfs_co;
    struct Fatfs_Flag_Str fatfs_fevent;
    struct Fatfs_Flag_Str fatfs_ulog;
};

/* LOCK ----------------------------------------------------------------------*/
/* 通讯互锁定时 */
#define COMMUNICATLOCKFUC         0xFF000000 //功能
#define COMMUNICATLOCKCLRCON      0x01000000 //清零
#define COMMUNICATLOCKRESET       0x02000000 //复位标志
#define COMMUNICATLOCKRECORD      0x04000000 //有数据存贮
#define COMMUNICATLOCKCLEAR       0x08000000 //清除记录
#define COMMUNICATLOCKJSON        0x10000000 //Json填写

#define COMMUNICATLOCKUSERSTA     0x0000FFFF //正在有设备使用
#define COMMUNICATLOCKUSERCON     0x000000FF //需要超时处理设备
#define COMMUNICATLOCKREADDIR     0x00010000 //读目录标志
#define COMMUNICATLOCKREADFILE    0x00020000 //读文件标志
#define COMMUNICATLOCKWRITEFILE   0x00040000 //写文件标志
#define COMMUNICATLOCKUSERNOCON   0x0000FF00 //不需要超时处理设备
#define COMMUNICATLOCKCOMTRADE    0x00000100 //写comtrate文件
#define COMMUNICATLOCKRANDOM      0x00000200 //写SOECO文件
#define COMMUNICATLOCKMAKEFS      0x00000400 //格式化文件
#define COMMUNICATLOCKLOSEPOWER   0x00000800 //失电
#define COMMUNICATLOCKWRITEJSON   0x00001000 //Json填写

enum
{
    COM_YK=0,
    COM_PARA,
    COM_FILE,
    COM_MAX
};

/* CONFIGE ----------------------------------------------------------------------*/
/* lwip_dev */
struct lwip_dev
{
    unsigned char mac[6]; // MAC address
    unsigned char remoteip[4]; // default ip address
    unsigned char ip[4]; // ip address
    unsigned char netmask[4]; // net mask address
    unsigned char gateway[4]; // gate address
    unsigned char dns[4];  // DNS server IP Address
    volatile unsigned char dhcpstatus; 
};

struct ConfigurationSetDatabase
{
//YX设置
    uint16_t YXSetNum;//YX设置总数
    uint16_t YXSet[299];//YX设置
//YC设置
    uint16_t YCAddr[300];//值
    uint16_t YCProperty[300];//属性
    float YCMultipleRate[300];//倍率
    float YCRatingValue[300];//额定值
    float YCDeadZone[300];//死区
//YK设置
    uint16_t YKAddr[16];//值
    uint16_t YKProperty[16];//属性
//模块设置
    uint16_t ModAddr[16];//值
    uint16_t ModYxNum[16];//yx个数
    uint16_t ModYcNum[16];//yc个数
    uint16_t ModYkNum[16];//yk个数
//ID设置
    uint16_t ID_Value[12];//值
};

struct ConfigurationSetModbase
{
    //模块设置
    uint16_t ModMaxNum;//值
    uint16_t ModYxMaxNum;//值
    uint16_t ModYcMaxNum;//值
    uint16_t ModYkMaxNum;//值
    uint16_t ModAddr[16];//值
    uint16_t ModYxAddr[16];//yx起始地址
    uint16_t ModYxNum[16];//yx个数
    uint16_t ModYcAddr[16];//yc起始地址
    uint16_t ModYcNum[16];//yc个数
    uint16_t ModYkAddr[16];//yk起始地址
    uint16_t ModYkNum[16];//yk个数
};


/* 属性值 */
#define NEWJUDG_AND 0x2

/* 属性配置 */
#define NEWPROPERTY_JUDG    0x0003 //判断

#define NEWJUDG_PROPERTY    0x00ff //属性判断（大类）
//移位
#define NEWPROPERTY_TI      0 //类型标识
#define NEWPROPERTY_NEG     2 //取反
#define NEWPROPERTY_SOE     4 //上送SOE
#define NEWPROPERTY_COS     6 //上送COS
#define NEWONEYX_PROPERTY   0 //属性
//判断位数
#define NEWJUDG_ADDR        0x0fff //地址判断
#define NEWJUDG_NUM         0x00ff //数量判断
#define NEWJUDG_VAULE       0x000f //值判断
#define NEWJUDG_CAL         0x000f //运算判断
//移位
#define NEWONEYX_VAULE      12 //值
#define NEWONEYX_NUM        8 //数量
#define NEWONEYX_ADDR       0 //地址
#define NEWCAL_AND          2 //与
#define NEWCAL_NEG          0 //非
#define NEWONEYX_CAL        12 //运算

struct HardwareInterfaceSetDatabase
{
//AI设置
    uint8_t AIArray[32];//排序
    uint8_t AIProperty[32];//属性
//DI设置
    uint8_t DIArray[32];//排序
    uint8_t DIProperty[32];//属性
};

/* PUBLIC VALUE ----------------------------------------------------------------------*/
/* 缓存后的数据，防止计算被打断 */
extern double g_IaSampleBuf[ADC_SAMPLE_NUM * 2]; 
extern double g_IbSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_IcSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_I0SampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UaSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UbSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UcSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_U0SampleBuf[ADC_SAMPLE_NUM * 2];

extern double g_UASampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_UCSampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_Udc1SampleBuf[ADC_SAMPLE_NUM * 2];
extern double g_Udc2SampleBuf[ADC_SAMPLE_NUM * 2];

/* 线程运行状态 */
extern uint16_t g_ThreadRunSta;
/* 采样队列 */
extern rt_int8_t g_SampleQueueIn;  // 入指针
extern Queue *g_SampleQueueBuf;// __attribute__((at(SDRAM_ADDR_WAVE)));    // 数据空间
extern uint16_t g_StartWave;

/* 系统配置 */
extern struct ConfigurationSetDatabase *g_ConfigurationSetDB;
extern struct HardwareInterfaceSetDatabase *g_HardwareInterfaceSetDB;
extern struct ConfigurationSetModbase      g_ConfigurationSetModDB; //模块结构

/* 系统时间 */
extern struct SD2405Time g_SystemTime;

/* 遥信缓存 */
extern TelesignalAddr       g_TelesignalAddr;
extern uint8_t				g_TelesignalDB[TELESIGNAL_TOTAL_NUM];	
/* 新遥信点表映射 */
extern rt_uint16_t g_NewMaxNumTelesignal;
extern rt_uint16_t *g_NewToOldTelesignal;//新点表映射

/* 遥测缓存 */
extern TelemetryAddr   g_TelemetryBaseAddr;
extern float g_TelemetryBaseDB[TELEMETRY_BASE_TOTAL_NUM];
extern float g_secondHarmonicIa, g_secondHarmonicIb, g_secondHarmonicIc;
#if RT_USING_TELEMETRY_SET
extern float    g_TelemetrySetEnable[TELEMETRY_BASE_TOTAL_NUM];
extern float    g_TelemetrySetValue[TELEMETRY_BASE_TOTAL_NUM];
#endif

